app/Controllers/StudentController.php

    public function index()
    {
        $fetchStudentModel = new StudentModel();
        $data['student'] = $fetchStudentModel->findAll();
---
SELECT *
FROM `students`

    public function store()
    {
        $insertStudent = new StudentModel();

        if ($img = $this->request->getFile('profile')) {
            if ($img->isValid() && !$img->hasMoved()) {
                $imageName = $img->getRandomName();
                $img->move('uploads/', $imageName);
            }
        }

        $data = array(
            'name' => $this->request->getPost('name'),
            'age' => $this->request->getPost('age'),
            'profile' => $imageName,
        );
        $insertStudent->insert($data);
---
INSERT INTO `students` (`name`, `age`, `profile`) VALUES ('John Doe', '35', '1704451032_edca73f3ecb5b5ef81a1.png')

    public function edit($id)
    {
        $fetchStudentModel = new StudentModel();
        $data['student'] = $fetchStudentModel->where('id', $id)->first();
---
SELECT *
FROM `students`
WHERE `id` = '1'
 LIMIT 1

    public function delete($id)
    {
        $deleteStudent = new StudentModel();
        $deleteStudent->delete($id);
---
DELETE FROM `students`
WHERE `id` IN ('3')